OpenFOAM-v2412/tutorials/multiphase/icoReactingMultiphaseInterFoam/poolEvaporationMultiComponent/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    massTransferMultiphaseSystem;

phases  (liquid gas);

liquid
{
    type            pureMovingPhaseModel;
}

gas
{
    type            multiComponentMovingPhaseModel;
}

surfaceTension
(
    (gas and liquid)
    {
        type            constant;
        sigma           0.07;
    }
);

massTransferModel
(
    (liquid to gas)
    {
        type                diffusionGasEvaporation;
        species             vapour.gas;
        isoAlpha            0.2;
        includeVolChange    false;
        saturationPressure
        {
            type    Antoine;
            A       3.55;
            B       643;
            C       -198;
        }
        C                   1;
        Tactivate           0;
    }
);


// ************************************************************************* //
